КонецФункции

&НаКлиенте
Функция ЯВыполняюКодВстроенногоЯзыкаЧерезФайлСобытияРасширениеСлужебный(Код, НаКлиенте, ПривилегированныйРежим = Ложь)
	
	Если НЕ КонтекстСохраняемый.Свойство("_СписокPIDКлиентовСМониторингомСобытий") Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	_СписокPIDКлиентовСМониторингомСобытий = КонтекстСохраняемый._СписокPIDКлиентовСМониторингомСобытий;
	ТекущийPIDКлиента = Ванесса.ТекущиеДанныеКлиентаТестирования().PIDКлиентаТестирования;
	Каталог = _СписокPIDКлиентовСМониторингомСобытий.Получить(ТекущийPIDКлиента);
	
	
	Если Каталог <> Неопределено Тогда
		
		ТекстСобытия = Новый Структура;
		Если НаКлиенте Тогда
			ТекстСобытия.Вставить("ВидСобытия","ВыполнитьКодНаКлиенте");
		Иначе
			Если ПривилегированныйРежим тогда
				ТекстСобытия.Вставить("ВидСобытия","ВыполнитьКодНаСервереПривилегировано");
			Иначе
				ТекстСобытия.Вставить("ВидСобытия","ВыполнитьКодНаСервере");
			КонецЕсли;	
		КонецЕсли;	
		ТекстСобытия.Вставить("Данные",Код);
		
		УникальныйИдентификаторСобытия = Новый УникальныйИдентификатор;
		ФайлСобытия = Каталог + ПолучитьРазделительПути() + "Event_RC_"+Строка(УникальныйИдентификаторСобытия)+".json";
		
		ЗаписьJson = Новый ЗаписьJson();
		ЗаписьJson.ОткрытьФайл(ФайлСобытия);
		ЗаписатьJSON(ЗаписьJson, ТекстСобытия); 
		ЗаписьJson.Закрыть();

		КонтекстСохраняемый.Вставить("_ИмяФайлаПоследнегоСобытия", ФайлСобытия);
		
	КонецЕсли;
КонецФункции 

&НаКлиенте
//И я вызываю внешнее событие "Источник" с событием "Событие" с данными "Данные" через файл события (Расширение)
//@ЯВызываюВнешнееСобытиеССобытиемСДаннымиЧерезФайлСобытияРасширение(ТабПарам)
Функция ЯВызываюВнешнееСобытиеССобытиемСДаннымиЧерезФайлСобытияРасширение(Источник, Событие, Данные) Экспорт

	Если НЕ КонтекстСохраняемый.Свойство("_СписокPIDКлиентовСМониторингомСобытий") Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	_СписокPIDКлиентовСМониторингомСобытий = КонтекстСохраняемый._СписокPIDКлиентовСМониторингомСобытий;
	ТекущийPIDКлиента = Ванесса.ТекущиеДанныеКлиентаТестирования().PIDКлиентаТестирования;
	Каталог = _СписокPIDКлиентовСМониторингомСобытий.Получить(ТекущийPIDКлиента);
	
	
	Если Каталог <> Неопределено Тогда
