&НаКлиенте
//И я ожидаю "10" секунд результат обработки последнего события через файл и запоминаю результат в переменную "ИмяПеременной"(Расширение)
//@ЯОжидаюСекундРезультатОбработкиПоследнегоСобытияЧерезФайлИЗапоминаюРезультатВПеременнуюРасширение(ТабПарам)
Функция ЯОжидаюСекундРезультатОбработкиПоследнегоСобытияЧерезФайлИЗапоминаюРезультатВПеременнуюРасширение(КоличествоСекунд, ИмяПеременной) Экспорт

	Если НЕ КонтекстСохраняемый.Свойство("_СписокPIDКлиентовСМониторингомСобытий") Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	_СписокPIDКлиентовСМониторингомСобытий = КонтекстСохраняемый._СписокPIDКлиентовСМониторингомСобытий;
	ТекущийPIDКлиента = Ванесса.ТекущиеДанныеКлиентаТестирования().PIDКлиентаТестирования;
	Каталог = _СписокPIDКлиентовСМониторингомСобытий.Получить(ТекущийPIDКлиента);
	
	
	Если Каталог <> Неопределено Тогда

		
		Ванесса.ЗапретитьВыполнениеШагов();
		
		ДатаНачалаОбработкиОжидания       = ТекущаяДата();
		КоличествоСекундОбработкаОжидания = Ванесса.ЗначениеТаймаутаДляАсинхронногоШага(КоличествоСекунд);
		КонтекстСохраняемый.Вставить("_ИмяПеременнойРезультатаСобытия", ИмяПеременной);
		ПодключитьОбработчикОжидания("ЯЖдуРезультатПоследнегоСобытияЧерезФайлОбработчикОжидания",1,Ложь);
		
	КонецЕсли;

	
КонецФункции

&НаКлиенте
Функция ЯЖдуРезультатПоследнегоСобытияЧерезФайлОбработчикОжидания()
