Перем Каталог Экспорт;
Перем ЗначениеРезультата Экспорт;
Перем ОшибкаРезультата Экспорт;
Перем Завершено Экспорт;
Перем ТекущийПрофиль Экспорт;
Функция ИдетВыполнениеСценариев() Экспорт
    Возврат Истина;
КонецФункции

Функция ТекущиеДанныеКлиентаТестирования() Экспорт
    Если ТекущийПрофиль <> Неопределено Тогда Возврат ТекущийПрофиль; КонецЕсли;
    Возврат Новый Структура("PIDКлиентаТестирования,ИмяКомпьютера,ПортЗапускаТестКлиента,ПутьКИнфобазе", 12345, "localhost", 12345, "/F example");
КонецФункции
Процедура ЗапретитьВыполнениеШагов() Экспорт
КонецПроцедуры
Функция ЗначениеТаймаутаДляАсинхронногоШага(КоличествоСекунд) Экспорт
    Возврат Число(КоличествоСекунд);
КонецФункции

Функция МногострочнаяСтрокаИзПараметраШага(Код) Экспорт
    Если ТипЗнч(Код) = Тип("Строка") Тогда Возврат Код; КонецЕсли;
    Возврат СтрСоединить(Код, Символы.ПС);
КонецФункции

Функция ФайлСуществуетКомандаСистемы(Имя) Экспорт
    Возврат Новый Файл(Имя).Существует();
КонецФункции
Процедура ПроверитьНеобходимостьЗакрытьСистемныйДиалог() Экспорт
КонецПроцедуры
Функция ПрочитатьОбъектJSON(Текст) Экспорт
    Чтение = Новый ЧтениеJSON; Чтение.УстановитьСтроку(Текст);
    Результат = ПрочитатьJSON(Чтение); Чтение.Закрыть();
    Возврат Результат;
КонецФункции
Процедура УдалитьФайлыКомандаСистемы(Имя) Экспорт
    УдалитьФайлы(Имя);
КонецПроцедуры
Функция ПолучитьТекстСообщенияПользователю(Текст) Экспорт
    Возврат Текст;
КонецФункции

Процедура СохранитьЗначениеПеременнойВКонтекст(Имя, Значение) Экспорт
    ЗначениеРезультата = Значение;
КонецПроцедуры

Процедура ПродолжитьВыполнениеШагов(Ошибка = Ложь, Текст = "") Экспорт
    Завершено = Истина;
    ОшибкаРезультата = ?(Ошибка, Текст, "");
КонецПроцедуры
