КонецФункции

&НаКлиенте
Функция ЯЖдуРезультатПоследнегоСобытияЧерезФайлОбработчикОжидания()
	
	ИмяОбработчика = "ЯЖдуРезультатПоследнегоСобытияЧерезФайлОбработчикОжидания";
	
	Если НЕ Ванесса.ИдетВыполнениеСценариев() Тогда
		ОтключитьОбработчикОжидания(ИмяОбработчика);
		Возврат Неопределено;
	КонецЕсли;
	
	Ванесса.ПроверитьНеобходимостьЗакрытьСистемныйДиалог();
	
	ЕстьРезультат = Ложь;
	
	ИмяФайлаРезультатСобытия = СтрЗаменить(КонтекстСохраняемый._ИмяФайлаПоследнегоСобытия, "Event", "Result");
	
	Если Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайлаРезультатСобытия) Тогда
		// Файл может уже существовать, но его запись не завершена.
		Попытка 
			Текст = Новый ЧтениеТекста;
			Текст.Открыть(ИмяФайлаРезультатСобытия, "UTF-8");
			ТекстФайла = Текст.Прочитать();
			Текст.Закрыть();
			
			//Решение для https://github.com/Pr-Mex/vanessa-automation/issues/2306
			ТекстФайла = СтрЗаменить(ТекстФайла, "\u001D", "\x_GS");
			
			ДанныеФайла = Ванесса.ПрочитатьОбъектJSON(ТекстФайла);
			
			Ванесса.СохранитьЗначениеПеременнойВКонтекст(КонтекстСохраняемый._ИмяПеременнойРезультатаСобытия, ДанныеФайла);
			
			Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайлаРезультатСобытия);
			ЕстьРезультат = Истина;
		Исключение
			
		КонецПопытки;	
		
	Иначе
		
	КонецЕсли;	

	
	Если ЕстьРезультат Тогда
		
		ОтключитьОбработчикОжидания(ИмяОбработчика);
		Ванесса.ПродолжитьВыполнениеШагов();
		Возврат Неопределено;
	КонецЕсли;	 
	
	Если (ТекущаяДата() - ДатаНачалаОбработкиОжидания) > КоличествоСекундОбработкаОжидания Тогда
		ОтключитьОбработчикОжидания(ИмяОбработчика);
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Ожидали в течение <%1> секунд появления файла %2");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",КоличествоСекундОбработкаОжидания);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ИмяФайлаРезультатСобытия);
		Ванесса.ПродолжитьВыполнениеШагов(Истина,ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;	 
КонецФункции

&НаКлиенте
Функция СгенерироватьСерийныйНомер(КоличествоСимволов, СпецСимволы = Ложь, ТолькоЦифры = Ложь) Экспорт
