КонецФункции	

&НаКлиенте
Функция ПолучитьМассивЗанятыхПортов()
	#Если НЕ ВебКлиент Тогда

	МассивЗанятыхПортов = Новый Массив;
	Если НЕ ЭтоLinux Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
		
		ТекстКоманды = "netstat -ano > """ + ИмяВременногоФайла + """"; 
		ВыполнитьКомандуОСБезПоказаЧерногоОкна(ТекстКоманды);
		
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(ИмяВременногоФайла, "UTF-8");
		
		Пока Истина Цикл
			Стр = Текст.ПрочитатьСтроку();
			Если Стр = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			Если Стр = "" Тогда
				Продолжить;
			КонецЕсли;	 
			
			Порт_ = Сред(Сред(СокрЛП(Стр), 8), 1, Найти(Сред(СокрЛП(Стр), 8), "  "));
			Порт = "";
			Для НомерСимвола = 0 По СтрДлина(Порт_) - 1 Цикл
				СимволСтроки = Сред(Порт_, СтрДлина(Порт_) - НомерСимвола, 1);
				Если СимволСтроки = ":" Тогда
					Прервать;
				КонецЕсли;			
				Если Найти("0123456789", СимволСтроки) > 0 Тогда
					Порт = СимволСтроки + Порт;
				КонецЕсли;			
			КонецЦикла;
			
			Попытка
				Если НЕ ПустаяСтрока(Порт) Тогда
					Порт = Число(Порт);
					МассивЗанятыхПортов.Добавить(Порт);
				КонецЕсли;	 
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЦикла;	
		Текст.Закрыть();
	Иначе
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
		СтрокаЗапускаСС = "ss -tuwan4 2>/dev/null | awk '{print $5}' | grep ':' | cut -d "":"" -f 2 | sort | uniq  > """ 
			+ ИмяВременногоФайла + """";// взято из #383
		СтрокаЗапускаСШ = "/bin/sh -c " + СтрокаЗапускаСС;
		ВыполнитьКомандуОС(СтрокаЗапускаСШ);
		
		ЗаписатьЛогВЖРИнформация("ПолучениеДанныхОЗанятыхПортах", СтрокаЗапускаСШ);
		
		Если ФайлСуществуетКомандаСистемы(ИмяВременногоФайла) Тогда
			
			Текст = Новый ЧтениеТекста;
			Текст.Открыть(ИмяВременногоФайла, "UTF-8");
			ТекстФайла = Текст.Прочитать();
			Текст.Закрыть();
			ЗаписатьЛогВЖРИнформация("ПолучениеДанныхОЗанятыхПортах", ТекстФайла);
			
			МассивСтрок = _СтрРазделить(ТекстФайла, Символы.ПС);
			Для Сч = 0 По МассивСтрок.Количество()-1 Цикл
				Стр = МассивСтрок[Сч];
				
				Если Стр = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				Если Стр = "" Тогда
					Продолжить;
				КонецЕсли;

				Порт = СокрЛП(Стр);
				Попытка
					Порт = Число(Порт);
					МассивЗанятыхПортов.Добавить(Порт);
				Исключение
					Продолжить;
				КонецПопытки;
				
			КонецЦикла;
			
		Иначе	
			ЗаписатьЛогВЖРОшибка("ПолучениеДанныхОЗанятыхПортах", "Файл ответа не найден.");
		КонецЕсли;	 
	КонецЕсли;
	
	Для каждого СтрокаДанныеКлиентовТестирования Из ДанныеКлиентовТестирования Цикл
		МассивЗанятыхПортов.Добавить(СтрокаДанныеКлиентовТестирования.ПортЗапускаТестКлиента);
	КонецЦикла;
	
	Возврат МассивЗанятыхПортов;

	#КонецЕсли
КонецФункции // ПолучитьЗанятыеПорты()

&НаКлиенте
Функция ПолучитьКорректноеИмяTesClient(Знач Стр)
