КонецФункции	

&НаКлиенте
Функция ПроверитьПортНаЗанятость(Знач Порт = 48000) Экспорт
	
	Если Порт <= 0 Или Порт > 65536 Тогда
		Порт = 48000;
	КонецЕсли;
	
	НачалоДиапазонаПортов    = 48000;
	ОкончаниеДиапазонаПортов = 50000;
	
	Если ЗначениеЗаполнено(Объект.ДиапазонПортовTestclient) Тогда
		// там должна быть строка вида 48000-48020
		МассивЗначений = РазложитьСтрокуВМассивПодстрокКлиент(Объект.ДиапазонПортовTestclient, "-");
		Если МассивЗначений.Количество() <> 2 Тогда
			ВызватьИсключение ПодставитьПараметрыВСтроку(
				Локализовать("Указан неверный диапазон портов: <%1>"),
				Объект.ДиапазонПортовTestclient
			);
		КонецЕсли;	 
		НачалоДиапазонаПортов = Число(МассивЗначений[0]);
		ОкончаниеДиапазонаПортов = Число(МассивЗначений[1]);
		Порт = НачалоДиапазонаПортов;
	КонецЕсли;	 
	
	МассивЗанятыхПортов = ПолучитьМассивЗанятыхПортов();
	Для Каждого ТекПорт Из МассивЗанятыхПортов Цикл
		ПортыКоторыеСчитаютсяЗанятыми.Вставить(ТекПорт, Истина);
	КонецЦикла;	 
	
	//Первый проход. Проверяем, что порт свободен сейчас и никогда не был занят.
	Если МассивЗанятыхПортов.Найти(Порт) <> Неопределено Тогда
		СвободныйПорт = НачалоДиапазонаПортов;
		// найти свободный порт в диапазоне
		Для Счетчик = НачалоДиапазонаПортов По ОкончаниеДиапазонаПортов Цикл
			Если МассивЗанятыхПортов.Найти(Счетчик) = Неопределено И ПортыКоторыеСчитаютсяЗанятыми[Счетчик] = Неопределено Тогда
				Возврат Счетчик;
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;	
	
	//Второй проход. Проверяем, что порт свободен сейчас.
	Если МассивЗанятыхПортов.Найти(Порт) <> Неопределено Тогда
		СвободныйПорт = НачалоДиапазонаПортов;
		// найти свободный порт в диапазоне
		Для Счетчик = НачалоДиапазонаПортов По ОкончаниеДиапазонаПортов Цикл
			Если МассивЗанятыхПортов.Найти(Счетчик) = Неопределено Тогда
				Возврат Счетчик;
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;	
	
	Возврат Порт;
	
КонецФункции // ПолучитьСвободныйПорт()

&НаКлиенте
Функция ОткрытьНовыйСеансTestClientИлиПодключитьУжеСуществующий(ДопПараметр = "", СтрокаОшибки = Неопределено) Экспорт 
