	
КонецПроцедуры

&НаКлиенте
Процедура ПолученСнимокЭкранаОбработчикОповещения(ДвоичныеДанные, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	
	#Если НЕ ВебКлиент Тогда
	
	ИмяФайла = ДополнительныеПараметры.ИмяФайла;
	ProcessId = ДополнительныеПараметры.ProcessId;
	ИмяПроцедуры = ДополнительныеПараметры.ИмяПроцедуры;
		
	Если ДвоичныеДанные = Неопределено Тогда
		Если Объект.ЗапускИзКоманднойСтроки Тогда
			ЗаписатьЛогВЖРОшибкаСервер("VanessaAutomation.ПолученСнимокЭкранаОбработчикОповещения",
				Локализовать("Не получилось снять скриншот с помощью внешней компоненты."));
			ПодключитьОбработчикОжидания(ИмяПроцедуры, 0.1, Истина);
			Возврат;
		Иначе	
			ВызватьИсключение ПодставитьПараметрыВСтроку(
				Локализовать("Не получилось снять скриншот с помощью внешней компоненты."));
		КонецЕсли;	 
	КонецЕсли;
		
	РезультатПрохождения = Неопределено;	
	РезультатПрохожденияСценария = Неопределено;
	ДополнительноПрикреплятьСкриншотКСценарию = Ложь;
	Если ЗначениеПараметровДляСнятияСкриншотов <> Неопределено Тогда
		Если ЗначениеПараметровДляСнятияСкриншотов.Свойство("РезультатПрохожденияТестовСценария") Тогда
			РезультатПрохождения = ЗначениеПараметровДляСнятияСкриншотов.РезультатПрохожденияТестовСценария;
		КонецЕсли;	 
		Если ЗначениеПараметровДляСнятияСкриншотов.Свойство("ПрикреплятьСкриншотКШагу") И ЗначениеПараметровДляСнятияСкриншотов.ПрикреплятьСкриншотКШагу Тогда
			ДополнительноПрикреплятьСкриншотКСценарию = Истина;
			Если ЗначениеПараметровДляСнятияСкриншотов.Свойство("РезультатПрохожденияШага") Тогда
				РезультатПрохождения = ЗначениеПараметровДляСнятияСкриншотов.РезультатПрохожденияШага;
			КонецЕсли;	 
			Если ЗначениеПараметровДляСнятияСкриншотов.Свойство("РезультатПрохожденияТестовСценария") Тогда
				РезультатПрохожденияСценария = ЗначениеПараметровДляСнятияСкриншотов.РезультатПрохожденияТестовСценария;
			КонецЕсли;	 
		КонецЕсли;	 
	Иначе	
		Попытка
			ИДСтрокиСценария = МассивСценариевДляВыполнения[ТекИД_СценарияВМассиве].СтрокаДерева;
			РезультатПрохождения = ПолучитьРезультатПрохожденияТестовСценария(ИДСтрокиСценария);
		Исключение
			РезультатПрохождения = Неопределено;
		КонецПопытки;
	КонецЕсли;	 
	
	Если ТипЗнч(ИмяФайла) = Тип("Строка") Тогда
		ДвоичныеДанные.Записать(ИмяФайла);
		
		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("ИмяФайла", ИмяФайла);
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
			Если ДополнительныеПараметры.Свойство("ИмяСкриншотаДляОтчета") Тогда
				ДанныеФайла.Вставить("ИмяСкриншотаДляОтчета", ДополнительныеПараметры.ИмяСкриншотаДляОтчета);
			КонецЕсли;	 
		КонецЕсли;	 
		
		ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ДанныеФайла);
		Если РезультатПрохождения <> Неопределено Тогда
			ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.ПолученСнимокЭкранаОбработчикОповещения.ДобавитьСкриншотКСценариюИлиШагу", ИмяФайла);
			МодульСкриншоты.ДобавитьСкриншотКСценариюИлиШагу(РезультатПрохождения, ДанныеФайла);
		КонецЕсли;	 
	Иначе	
		ИмяФайлаСкриншота = СформироватьИмяФайлаСкриншота();
		ДвоичныеДанные.Записать(ИмяФайлаСкриншота);
		
		Если  ДополнительныеПараметры.Свойство("ИмяСкриншотаДляОтчета")
			И ДополнительныеПараметры.ИмяСкриншотаДляОтчета <> Неопределено Тогда
			ДанныеФайла = Новый Структура;
			ДанныеФайла.Вставить("ИмяФайла", ИмяФайлаСкриншота);
			ДанныеФайла.Вставить("ЗаголовокВнутреннегоОкна", ДополнительныеПараметры.ИмяСкриншотаДляОтчета);
			ИмяФайла.Добавить(ДанныеФайла);
			ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ДанныеФайла);
		Иначе	
			ИмяФайла.Добавить(ИмяФайлаСкриншота);
			ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ИмяФайлаСкриншота);
		КонецЕсли;	 
		
		Если РезультатПрохождения <> Неопределено Тогда
			Для Каждого Элем Из ИмяФайла Цикл
				ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.ПолученСнимокЭкранаОбработчикОповещения.ДобавитьСкриншотКСценариюИлиШагу", Элем);
				МодульСкриншоты.ДобавитьСкриншотКСценариюИлиШагу(РезультатПрохождения, Элем);
				
				Если ДополнительноПрикреплятьСкриншотКСценарию Тогда
					
					Если ТипЗнч(Элем) = Тип("Структура") Тогда
						
						ФайлСкриншота = Новый Файл(Элем.ИмяФайла);
						ДанныеСкриншотаДляСценария = СкопироватьСтруктуру(Элем);
						
					Иначе	
						
						ФайлСкриншота = Новый Файл(Элем);
						ДанныеСкриншотаДляСценария = Новый Структура;
						
					КонецЕсли;	 
					
					ИмяВременногоФайла = ПолучитьИмяВременногоФайла("png");
					ФайлИмяВременногоФайла = Новый Файл(ИмяВременногоФайла);
					
					ИмяФайлаСкриншота = СформироватьИмяФайлаСкриншота();
					ФайлИмяФайлаСкриншота = Новый Файл(ИмяФайлаСкриншота);
					НужноеИмяФайла = ФайлИмяВременногоФайла.Путь + ФайлИмяФайлаСкриншота.Имя;
					
					ДанныеСкриншотаДляСценария.Вставить("ИмяФайла", НужноеИмяФайла);
					ДанныеСкриншотаДляСценария.Вставить("ИсходноеИмяФайла", ФайлСкриншота.Имя);
					КопироватьФайлКомандаСистемы(ФайлСкриншота.ПолноеИмя, ДанныеСкриншотаДляСценария.ИмяФайла);
					
					МодульСкриншоты.ДобавитьСкриншотКСценариюИлиШагу(РезультатПрохожденияСценария, ДанныеСкриншотаДляСценария);
					
				КонецЕсли;	 
				
			КонецЦикла;	 
		КонецЕсли;	 
	КонецЕсли;	
	
	ПодключитьОбработчикОжидания(ИмяПроцедуры, 0.1, Истина);
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеКлиентаТестированияПоProcessId(PIDКлиентаТестирования)
	
КонецФункции	 

&НаКлиенте
Процедура ПолученСнимокОкна(ДвоичныеДанные, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	
	#Если НЕ ВебКлиент Тогда
	
	ИмяФайла = ДополнительныеПараметры.ИмяФайла;
	ИмяФайлаСкриншота = СформироватьИмяФайлаСкриншота();
	
	Если ДвоичныеДанные = Неопределено Тогда
		Если Объект.ЗапускИзКоманднойСтроки Тогда
			ЗаписатьЛогВЖРОшибкаСервер("VanessaAutomation.ПолученСнимокОкна", Локализовать("Не получилось снять скриншот с помощью внешней компоненты."));
			СнятьСкриншотОкнаАсинхронно(ДополнительныеПараметры);
			Возврат;
		Иначе	
			ВызватьИсключение ПодставитьПараметрыВСтроку(
				Локализовать("Не получилось снять скриншот с помощью внешней компоненты."));
		КонецЕсли;	 
	КонецЕсли;	 
	
	ДвоичныеДанные.Записать(ИмяФайлаСкриншота);
	
	ДанныеФайла = Новый Структура;
	ДанныеФайла.Вставить("ИмяФайла",ИмяФайлаСкриншота);
	Если ДополнительныеПараметры.Свойство("ДанныеОкна") Тогда
		Попытка
			ЗаголовокВнутреннегоОкна = ДополнительныеПараметры.ДанныеОкна.Title;
			Если ДополнительныеПараметры.ДанныеОкна.Свойство("ProcessId") Тогда
				ЗаголовокВнутреннегоОкна = ЗаголовокВнутреннегоОкна + " (PID:" + XMLСтрока(ДополнительныеПараметры.ДанныеОкна.ProcessId) + ")";
			КонецЕсли;	
			ДанныеФайла.Вставить("ЗаголовокВнутреннегоОкна", ЗаголовокВнутреннегоОкна);
		Исключение
			
		КонецПопытки;
	КонецЕсли;	 
	Если ДополнительныеПараметры.Свойство("ProcessId") Тогда
		ProcessId = ДополнительныеПараметры.ProcessId;
		Если ProcessId <> Неопределено И ProcessId > 0 Тогда
			ДанныеКлиентаТестирования = ДанныеКлиентаТестированияПоProcessId(ProcessId);
			Если ДанныеКлиентаТестирования <> Неопределено Тогда
				ДанныеФайла.Вставить("ИмяКлиентаТестирования",ДанныеКлиентаТестирования.Имя);
			Иначе
				Попытка
					PIDЭтогоСеансаЧисло = Число(PIDЭтогоСеанса);
				Исключение
					PIDЭтогоСеансаЧисло = 0;
				КонецПопытки;
				Если (ProcessId = PIDЭтогоСеансаЧисло) И (PIDЭтогоСеансаЧисло > 0) Тогда
					ДанныеФайла.Вставить("ИмяКлиентаТестирования","TestManager");
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
	ИмяФайла.Добавить(ДанныеФайла);
	ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ДанныеФайла);
	
	ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.ПолученСнимокОкна", ЗаписатьОбъектJSON(ДанныеФайла));
	
	ПрикреплятьСкриншотКШагу = Истина;
	Если ПрикреплятьСкриншотКШагу Тогда
		ДанныеФайла2 = Новый Структура;
		ИмяФайлаСкриншота2 = ПолучитьИмяВременногоФайла("png");
		КопироватьФайлКомандаСистемы(ИмяФайлаСкриншота, ИмяФайлаСкриншота2);
		ДанныеФайла2.Вставить("ИмяФайла", ИмяФайлаСкриншота2);
		Если ДанныеФайла.Свойство("ЗаголовокВнутреннегоОкна") Тогда
			ДанныеФайла2.Вставить("ЗаголовокВнутреннегоОкна", ДанныеФайла.ЗаголовокВнутреннегоОкна);
		КонецЕсли;	 
		Если ДанныеФайла.Свойство("ИмяКлиентаТестирования") Тогда
			ДанныеФайла2.Вставить("ИмяКлиентаТестирования", ДанныеФайла.ИмяКлиентаТестирования);
		КонецЕсли;	 
		ДанныеФайла2.Вставить("ПрикреплятьСкриншотКШагу",ПрикреплятьСкриншотКШагу);
		
		ИДСтрокиСценария                   = МассивСценариевДляВыполнения[ТекИД_СценарияВМассиве].СтрокаДерева;
		РезультатПрохожденияТестовСценария = ПолучитьРезультатПрохожденияТестовСценария(ИДСтрокиСценария);
		РезультатПрохожденияТестовШагов = РезультатПрохожденияТестовСценария.РезультатПрохожденияТестовШагов;
		Если РезультатПрохожденияТестовШагов.Количество() > 0 Тогда
			РезультатПрохожденияШага = РезультатПрохожденияТестовШагов[РезультатПрохожденияТестовШагов.Количество() - 1];
			МодульСкриншоты.ДобавитьСкриншотКСценариюИлиШагу(РезультатПрохожденияШага, ДанныеФайла2);
		КонецЕсли;	 
	КонецЕсли;	 
	
	СнятьСкриншотОкнаАсинхронно(ДополнительныеПараметры);
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьСкриншотОкнаАсинхронно(ДополнительныеПараметры)
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура СделатьСкриншотКомпонента(ПараметрыСкриншотов, СтруктураШага = Неопределено)
	
	ИмяФайла = ПараметрыСкриншотов.ИмяФайла;
	ЭтоДополнительныйПроцессДляСнятиеСкриншотов = Ложь;
	Если ПараметрыСкриншотов.Свойство("ЭтоДополнительныйПроцессДляСнятиеСкриншотов") Тогда
		ЭтоДополнительныйПроцессДляСнятиеСкриншотов = ПараметрыСкриншотов.ЭтоДополнительныйПроцессДляСнятиеСкриншотов;
	КонецЕсли;	
	
	СтрокаРодитель = Неопределено;
	Если ТипЗнч(СтруктураШага) = Тип("Структура") Тогда 
		НужнаяСтрока = Неопределено;
		НайтиСтрокуДереваПоИдСтроки(СтруктураШага.ИдСтроки, Объект.ДеревоТестов.ПолучитьЭлементы(), НужнаяСтрока);
		СтрокаРодитель = НужнаяСтрока.ПолучитьРодителя();
	КонецЕсли;
	
	МассивКомментариевШага = Неопределено;
	Если ТипЗнч(СтруктураШага) = Тип("Структура") 
		И СтруктураШага.Свойство("МассивКомментариевШага") 
			И ТипЗнч(СтруктураШага.МассивКомментариевШага) = Тип("Массив") Тогда
		
		МассивКомментариевШага = СтруктураШага.МассивКомментариевШага;  
		
	ИначеЕсли СтрокаРодитель <> Неопределено Тогда   
		
		// Для директивы #[autodoc.groupsteps]: Если #[autodoc.screenarea] расположен над ней.
		Если ТипЗнч(СтрокаРодитель.ПроизвольныеЗначения) = Тип("Структура") 
			И СтрокаРодитель.ПроизвольныеЗначения.Свойство("МассивКомментариевШага") 
				И ТипЗнч(СтрокаРодитель.ПроизвольныеЗначения.МассивКомментариевШага) = Тип("Массив") Тогда
				
			МассивКомментариевШага = СтрокаРодитель.ПроизвольныеЗначения.МассивКомментариевШага; 
			
		КонецЕсли;		
		
	КонецЕсли;	
	
	// Если была передана директива #[autodoc.screenarea], то снимок делаем по переданным координатам.
	КоординатыОбласти = Новый Массив;
	Если ТипЗнч(МассивКомментариевШага) = Тип("Массив") Тогда
		
		ДирективаСнимкаПоОбласти = "[autodoc.screenarea]";
		
		Для Каждого КомментарийШага Из МассивКомментариевШага Цикл
			Поз = Найти(НРег(КомментарийШага), ДирективаСнимкаПоОбласти); 
			Если Поз > 0 Тогда
				СлужебнаяСтрокаСнимкаПоОбласти = СокрЛП(Сред(КомментарийШага, Поз + СтрДлина(ДирективаСнимкаПоОбласти)));
				КоординатыОбласти = _СтрРазделить(СлужебнаяСтрокаСнимкаПоОбласти, ",", Ложь);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ЭтоСкриншотБраузера = Ложь;
	Если ТипЗнч(МассивКомментариевШага) = Тип("Массив") Тогда
		
		ДирективаСнимкаПоОбласти = "[autodoc.screenareabrowser]";
		
		Для Каждого КомментарийШага Из МассивКомментариевШага Цикл
			Поз = Найти(НРег(КомментарийШага), ДирективаСнимкаПоОбласти); 
			Если Поз > 0 Тогда
				СлужебнаяСтрокаСнимкаПоОбласти = СокрЛП(Сред(КомментарийШага, Поз + СтрДлина(ДирективаСнимкаПоОбласти)));
				КоординатыОбласти = _СтрРазделить(СлужебнаяСтрокаСнимкаПоОбласти, ",", Ложь);
				ЭтоСкриншотБраузера = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	
	Режим = Неопределено;
	ProcessId = Неопределено;
	ИмяПроцедуры = Неопределено;
	СпособСнятияСкриншотовВнешнейКомпонентой = Неопределено;
	ИмяСкриншотаДляОтчета = Неопределено;
	ПараметрыСкриншотов.Свойство("Режим",Режим);
	ПараметрыСкриншотов.Свойство("ProcessId",ProcessId);
	ПараметрыСкриншотов.Свойство("ИмяПроцедуры",ИмяПроцедуры);
	ПараметрыСкриншотов.Свойство("СпособСнятияСкриншотовВнешнейКомпонентой",СпособСнятияСкриншотовВнешнейКомпонентой);
	ПараметрыСкриншотов.Свойство("ИмяСкриншотаДляОтчета",ИмяСкриншотаДляОтчета);
	
	ЗаполнитьПараметрыДляСнятияСкриншотов(ПараметрыСкриншотов);
		
	Если СпособСнятияСкриншотовВнешнейКомпонентой = Неопределено Тогда
		СпособСнятияСкриншотовВнешнейКомпонентой = Объект.СпособСнятияСкриншотовВнешнейКомпонентой;
	КонецЕсли;
	
	Если ЭтоДополнительныйПроцессДляСнятиеСкриншотов Тогда
		СпособСнятияСкриншотовВнешнейКомпонентой = 2; //Скриншот делается с окон процесса
	КонецЕсли;	
	
	Если ПараметрыСкриншотов.Свойство("ТолькоПроцессКлиентаТестирования") И ПараметрыСкриншотов.ТолькоПроцессКлиентаТестирования Тогда
		ПараметрыСкриншотов.Вставить("СпособСнятияСкриншотовВнешнейКомпонентой", 1); //используется, когда идёт снятие скриншотов после того, как был закрыт модальный диалог
	КонецЕсли;
	
	Если ВнешняяКомпонентаДляСкриншотов = Неопределено Тогда
		ЗаписатьЛогВЖРОшибка("VanessaAutomation.СделатьСкриншотКомпонента", "Комонента VanessaExt не была корректно установлена.");
		Если ИмяПроцедуры <> Неопределено Тогда
			ПодключитьОбработчикОжидания(ИмяПроцедуры, 0.1, Истина);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Если Режим = "Проверка" Тогда
		// Снимаем область экрана.
		ДвоичныеДанные = ВнешняяКомпонентаДляСкриншотов.ПолучитьСнимокЭкрана(0);
		Если ДвоичныеДанные = Неопределено Тогда
			ВызватьИсключение ПодставитьПараметрыВСтроку(
				Локализовать("Не получилось снять скриншот с помощью внешней компоненты."));
		КонецЕсли;	 
		
		Если ТипЗнч(ИмяФайла) = Тип("Строка") Тогда
			ДвоичныеДанные.Записать(ИмяФайла);
			ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ИмяФайла);
		Иначе	
			ИмяФайлаСкриншота = СформироватьИмяФайлаСкриншота();
			ДвоичныеДанные.Записать(ИмяФайлаСкриншота);
			ИмяФайла.Добавить(ИмяФайлаСкриншота);
			ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ИмяФайлаСкриншота);
		КонецЕсли;
		
	ИначеЕсли СпособСнятияСкриншотовВнешнейКомпонентой = 0 Тогда
		
		СкриншотКомпонентойВсегоЭкрана(ИмяПроцедуры, ИмяФайла, ИмяСкриншотаДляОтчета, Режим, ProcessId, КоординатыОбласти);
		Если ЭтоСкриншотБраузера Тогда
			МодульРаботаСБраузером.СнимокЭкранаБраузера(ИмяФайла, КоординатыОбласти);
		КонецЕсли;
		
	ИначеЕсли СпособСнятияСкриншотовВнешнейКомпонентой = 1 Тогда
		Если ProcessId = Неопределено Тогда
			ProcessId = PIDТекущегоКлиентаТестирования;
		КонецЕсли;	 
		
		Если ProcessId = Неопределено Тогда
			СкриншотКомпонентойВсегоЭкрана(ИмяПроцедуры, ИмяФайла, ИмяСкриншотаДляОтчета, Режим, ProcessId);
			Возврат;
		КонецЕсли;	 
		
		Если ИмяПроцедуры = Неопределено Тогда
			ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.ПолучитьСнимокПроцесса", "ProcessId=" + ProcessId);
			ДвоичныеДанные = ВнешняяКомпонентаДляСкриншотов.ПолучитьСнимокПроцесса(ProcessId);
			Если ДвоичныеДанные = Неопределено Тогда
				ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.ПолучитьСнимокЭкрана", "");
				ДвоичныеДанные = ВнешняяКомпонентаДляСкриншотов.ПолучитьСнимокЭкрана(0);
			КонецЕсли;	 
			
			Если ТипЗнч(ИмяФайла) = Тип("Строка") Тогда
				ДвоичныеДанные.Записать(ИмяФайла);
				ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ИмяФайла);
			Иначе	
				ИмяФайлаСкриншота = СформироватьИмяФайлаСкриншота();
				ДвоичныеДанные.Записать(ИмяФайлаСкриншота);
				ИмяФайла.Добавить(ИмяФайлаСкриншота);
				ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ИмяФайлаСкриншота);
			КонецЕсли;	 
			
		Иначе	
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ИмяФайла",ИмяФайла);
			ДопПараметры.Вставить("Режим",Режим);
			ДопПараметры.Вставить("ProcessId",ProcessId);
			ДопПараметры.Вставить("ИмяПроцедуры",ИмяПроцедуры);
			ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.ТекущееОкноКлиентаТестирования", ЗаписатьОбъектJSON(ДопПараметры));
			ОписаниеОповещения = Новый ОписаниеОповещения("ПолученСнимокЭкранаОбработчикОповещения", ЭтаФорма, ДопПараметры);
			ВнешняяКомпонентаДляСкриншотов.НачатьВызовПолучитьСнимокПроцесса(ОписаниеОповещения, ProcessId);
		КонецЕсли;	 
		
	ИначеЕсли СпособСнятияСкриншотовВнешнейКомпонентой = 2 Тогда
		Если ProcessId = Неопределено Тогда
			PIDТекущегоКлиентаТестирования = PIDТекущегоКлиентаТестирования();
			ProcessId = PIDТекущегоКлиентаТестирования;
		КонецЕсли;	 
		
		Если (ProcessId = Неопределено ИЛИ ProcessId = 0) И ИмяПроцедуры <> Неопределено Тогда
			СкриншотКомпонентойВсегоЭкрана(ИмяПроцедуры, ИмяФайла, ИмяСкриншотаДляОтчета, Режим, ProcessId);
			Возврат;
		КонецЕсли;
		
		Если (ProcessId = Неопределено ИЛИ ProcessId = 0) Тогда
			// Дальше нет смысла выполнять код, т.к. там будет попытка работать с процессом по его PID
			ВызватьИсключение Локализовать("Не найден процесс клиента тестирования.");
		КонецЕсли;
		
		Если ИмяПроцедуры = Неопределено Тогда
			ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.ПолучитьСписокОкон", "ProcessId=" + ProcessId);
			РезультатВызова = ВнешняяКомпонентаДляСкриншотов.ПолучитьСписокОкон(ProcessId);
			ДанныеОкон = ПрочитатьСтрокуJSON(РезультатВызова);
			Если ТипЗнч(ДанныеОкон) = Тип("Массив") Тогда
				
				ОкнаДляСкриншотов = Новый Массив;
				
				Для каждого ДанныеОкна из ДанныеОкон Цикл
					Если ЭтоОкноНеДляСнятияСкриншотов(ДанныеОкна) Тогда
						Продолжить;
					КонецЕсли;	 
					
					ОкнаДляСкриншотов.Добавить(ДанныеОкна);
				КонецЦикла;
				
				ЗаписатьЛогВЖРИнформация("СписокПроцессовСкриншоты", _СтрШаблон("Найдено <%1> окон для снятия скриншотов.", ОкнаДляСкриншотов.Количество()));
				
				Для каждого ДанныеОкна из ОкнаДляСкриншотов Цикл
					
					ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.ПолучитьСнимокОкна", ЗаписатьОбъектJSON(ДанныеОкна));
					ДвоичныеДанные = ВнешняяКомпонентаДляСкриншотов.ПолучитьСнимокОкна(ДанныеОкна.window);
					
					Если ДвоичныеДанные = Неопределено Тогда
						Если Объект.ЗапускИзКоманднойСтроки Тогда
							ЗаписатьЛогВЖРОшибкаСервер("VanessaAutomation.СделатьСкриншотКомпонента",
								Локализовать("Не получилось снять скриншот с помощью внешней компоненты."));
							Возврат;
						Иначе
							ВызватьИсключение ПодставитьПараметрыВСтроку(
								Локализовать("Не получилось снять скриншот с помощью внешней компоненты."));
						КонецЕсли;
					КонецЕсли;
					Если ТипЗнч(ИмяФайла) = Тип("Строка") Тогда
						ДвоичныеДанные.Записать(ИмяФайла);
					Иначе	
						ИмяФайлаСкриншота = СформироватьИмяФайлаСкриншота();
						ДвоичныеДанные.Записать(ИмяФайлаСкриншота);
						ИмяФайла.Добавить(ИмяФайлаСкриншота);
					КонецЕсли;	 
				КонецЦикла;
				
			КонецЕсли;

		Иначе	
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ИмяФайла",ИмяФайла);
			ДопПараметры.Вставить("Режим",Режим);
			ДопПараметры.Вставить("ProcessId",ProcessId);
			ДопПараметры.Вставить("ИмяПроцедуры",ИмяПроцедуры);
			ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.НачатьВызовПолучитьСписокОкон", ЗаписатьОбъектJSON(ДопПараметры));
			ОписаниеОповещения = Новый ОписаниеОповещения("ПолученСписокОконПроцессаОбработчикОповещения", ЭтаФорма, ДопПараметры);
			ВнешняяКомпонентаДляСкриншотов.НачатьВызовПолучитьСписокОкон(ОписаниеОповещения, ProcessId);
		КонецЕсли;
		
	Иначе
		ВызватьИсключение ПодставитьПараметрыВСтроку(
			Локализовать("Неизвестный вариант снятия скриншота: <%1>."),
			СпособСнятияСкриншотовВнешнейКомпонентой
		);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьСкриншотВнешнейПрограммой(ДопПараметры)
	
КонецПроцедуры

&НаКлиенте
Процедура СкриншотКомпонентойВсегоЭкрана(ИмяПроцедуры, ИмяФайла, Знач ИмяСкриншотаДляОтчета, Режим, ProcessId, КоординатыОбласти = Неопределено)
	Если ИмяСкриншотаДляОтчета = Неопределено Тогда
		ИмяСкриншотаДляОтчета = "MainScreen";
	КонецЕсли;
	
	ДопОписаниеСкриншота = ПолучитьДопОписаниеСкриншота();
	Если ЗначениеЗаполнено(ДопОписаниеСкриншота) Тогда
		ИмяСкриншотаДляОтчета = ИмяСкриншотаДляОтчета + ДопОписаниеСкриншота;
	КонецЕсли;
	ПрикреплятьСкриншотКШагу = ОпределитьПрикреплятьСкриншотКШагу();
	
	Если ИмяПроцедуры = Неопределено Тогда
		ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.СкриншотКомпонентойВсегоЭкрана", ИмяСкриншотаДляОтчета);
		
		Если ЗначениеЗаполнено(КоординатыОбласти) И КоординатыОбласти.Количество() > 0 Тогда
			ДвоичныеДанные = ВнешняяКомпонентаДляСкриншотов.ПолучитьСнимокОбласти(
				Число(КоординатыОбласти[0]), 
				Число(КоординатыОбласти[1]), 
				Число(КоординатыОбласти[2]), 
				Число(КоординатыОбласти[3]));
		Иначе
			ДвоичныеДанные = ВнешняяКомпонентаДляСкриншотов.ПолучитьСнимокЭкрана(0);
		КонецЕсли;
		
		Если ДвоичныеДанные = Неопределено Тогда
			Если Объект.ЗапускИзКоманднойСтроки Тогда
				ЗаписатьЛогВЖРОшибкаСервер("VanessaAutomation.СкриншотКомпонентойВсегоЭкрана",
					Локализовать("Не получилось снять скриншот с помощью внешней компоненты."));
				Возврат;
			Иначе	
				ВызватьИсключение ПодставитьПараметрыВСтроку(
					Локализовать("Не получилось снять скриншот с помощью внешней компоненты."));
			КонецЕсли;	 
		КонецЕсли;	 
		Если ТипЗнч(ИмяФайла) = Тип("Строка") Тогда
			ДвоичныеДанные.Записать(ИмяФайла);
			ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ИмяФайла);
		Иначе	
			ИмяФайлаСкриншота = СформироватьИмяФайлаСкриншота();
			ДвоичныеДанные.Записать(ИмяФайлаСкриншота);
			
			Если ИмяСкриншотаДляОтчета = Неопределено Тогда
				ИмяФайла.Добавить(ИмяФайлаСкриншота);
				ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ИмяФайлаСкриншота);
			Иначе	
				ДанныеФайла = Новый Структура;
				ДанныеФайла.Вставить("ИмяФайла",ИмяФайлаСкриншота);
				ДанныеФайла.Вставить("ЗаголовокВнутреннегоОкна", ИмяСкриншотаДляОтчета);
				ДанныеФайла.Вставить("ПрикреплятьСкриншотКШагу", ПрикреплятьСкриншотКШагу);
				ИмяФайла.Добавить(ДанныеФайла);
				ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ДанныеФайла);
			КонецЕсли;	 
			
		КонецЕсли;	 
	Иначе	
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИмяФайла",ИмяФайла);
		ДопПараметры.Вставить("Режим",Режим);
		ДопПараметры.Вставить("ProcessId",ProcessId);
		ДопПараметры.Вставить("ИмяПроцедуры",ИмяПроцедуры);
		ДопПараметры.Вставить("ИмяСкриншотаДляОтчета",ИмяСкриншотаДляОтчета);
		ДопПараметры.Вставить("ПрикреплятьСкриншотКШагу",ПрикреплятьСкриншотКШагу);
		
		ЗаписатьЛогВЖРИнформация("СнятиеСкриншота.СкриншотКомпонентойВсегоЭкрана", ЗаписатьОбъектJSON(ДопПараметры));
		
		// Лучше тут сделать проверку структуры и вызов другово метода компоненты
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолученСнимокЭкранаОбработчикОповещения", ЭтаФорма, ДопПараметры);
		ВнешняяКомпонентаДляСкриншотов.НачатьВызовПолучитьСнимокЭкрана(ОписаниеОповещения, 0);
	КонецЕсли;	 
КонецПроцедуры 

#КонецОбласти

	СообщитьПользователю(Локализовать("Делаю скриншот."));
	СделатьСкриншотОшибкиТекущегоОкна("СделатьСкриншотыОшибкиКаждогоОкна1СSikuliX");
КонецПроцедуры
&НаКлиенте
Процедура СделатьСкриншотОшибкиТекущегоОкна(ИмяПроцедуры, ДопПараметры = Неопределено)
	МассивСкриншотов = Новый Массив;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;	 
	ДопПараметры.Вставить("ИмяФайла",МассивСкриншотов);
	ДопПараметры.Вставить("ИмяПроцедуры",ИмяПроцедуры);
	СделатьСкриншот(ДопПараметры);
	
	Если НЕ (Объект.ИспользоватьКомпонентуVanessaExt И Объект.ИспользоватьВнешнююКомпонентуДляСкриншотов) Тогда
		РезультатПрохожденияТестовСценария = ЗначениеПараметровДляСнятияСкриншотов.РезультатПрохожденияТестовСценария;
		Для Каждого Элем Из МассивСкриншотов Цикл
			МодульСкриншоты.ДобавитьСкриншотКСценариюИлиШагу(РезультатПрохожденияТестовСценария, Элем);
		КонецЦикла;	 
		
		ПодключитьОбработчикОжидания(ИмяПроцедуры, 0.1, Истина);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура СделатьСкриншотыОшибкиКаждогоОкна1СSikuliX() Экспорт
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура СделатьСкриншотыВсехОконКомпонента()
	Если ТекущийTestclientЭтоWebКлиент Тогда
		МассивФайлов = Новый Массив;
		ПараметрыСкриншотов = Новый Структура;
		ПараметрыСкриншотов.Вставить("ИмяФайла", МассивФайлов);
		ПараметрыСкриншотов.Вставить("ИмяПроцедуры", "СделатьСкриншотыВсехОконКомпонентаПродолжение");
		ПараметрыСкриншотов.Вставить("СпособСнятияСкриншотовВнешнейКомпонентой", 0);
		ПараметрыСкриншотов.Вставить("ИмяСкриншотаДляОтчета", "MainScreen");
		СделатьСкриншотКомпонента(ПараметрыСкриншотов);
		Возврат;
	КонецЕсли;	 
	
	СделатьСкриншотыВсехОконКомпонентаПродолжение();
КонецПроцедуры 

&НаКлиенте
Процедура ОпределитьСвойстваПроцессаИСделатьСкриншотЕслиНеобходимоОбработкаОповещения(РезультатВызова, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	
	ЭтоДополнительныйПроцессДляСнятиеСкриншотов = Ложь;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ДанныеПроцесса") Тогда
			ДанныеПроцесса = ДополнительныеПараметры.ДанныеПроцесса;
			Если ДанныеПроцесса.Свойство("ЭтоДополнительныйПроцессДляСнятиеСкриншотов") Тогда
				ЭтоДополнительныйПроцессДляСнятиеСкриншотов = ДанныеПроцесса.ЭтоДополнительныйПроцессДляСнятиеСкриншотов;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Данные = ПрочитатьСтрокуJSON(РезультатВызова);
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Если Найти(НРег(Данные.Name),"1cv8") > 0 ИЛИ ЭтоДополнительныйПроцессДляСнятиеСкриншотов Тогда
			
			МассивФайлов = Новый Массив;
			ПараметрыСкриншотов = Новый Структура;
			ПараметрыСкриншотов.Вставить("ИмяФайла",МассивФайлов);
			ПараметрыСкриншотов.Вставить("ProcessId",Данные.ProcessId);
			ПараметрыСкриншотов.Вставить("ИмяПроцедуры","ОпределитьСвойстваПроцессаИСделатьСкриншотЕслиНеобходимо");
			ПараметрыСкриншотов.Вставить("ЭтоДополнительныйПроцессДляСнятиеСкриншотов",ЭтоДополнительныйПроцессДляСнятиеСкриншотов);
			СделатьСкриншотКомпонента(ПараметрыСкриншотов);
			Возврат;
			
		КонецЕсли;	 
		ОпределитьСвойстваПроцессаИСделатьСкриншотЕслиНеобходимо();
	Иначе	
		ПерейтиКВыполнениюСледующегоСценария();
	КонецЕсли;	 
КонецПроцедуры 

&НаКлиенте
Процедура СнятьСкриншотыОтдельныеПроцессы()
	
КонецПроцедуры	

&НаКлиенте
Процедура СделатьСкриншотыОшибкиПродолжение()
	Если Объект.ИспользоватьКомпонентуVanessaExt
		И Объект.ИспользоватьВнешнююКомпонентуДляСкриншотов
		И ЗначениеЗаполнено(Объект.ПроцессыДляСнятияСкриншотов)
		И НЕ ВыполнялосьСнятиеСкриншотовДополнительныхПроцессов
		Тогда
		
		УказанаПроцедураПослеСнятияСкриншотовПроцессов = "СделатьСкриншотыОшибкиПродолжение";
		СнятьСкриншотыОтдельныеПроцессы();
		
		Возврат;
	КонецЕсли;	

	
	// Если на экране модальный диалог - закроем его, сделаем паузу и снимем ещё один скриншот
	// т.к. часто после закрытия диалога можно получить дополнительную информацию об ошибке
	Если НЕ (Объект.ИспользоватьКомпонентуVanessaExt И Объект.ИспользоватьВнешнююКомпонентуДляСкриншотов)
	ИЛИ  (Объект.ИспользоватьКомпонентуVanessaExt И Объект.ИспользоватьВнешнююКомпонентуДляСкриншотов) 
	Тогда
		//Закрытие модального диалога надо сделать, если скриншоты снимаются внешней прграммой, либо компонентой, но только одно окно.
		Если ЗакрытьМодальныйДиалогИСнятьСкриншот() Тогда
			Возврат;
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если ТипЗнч(ЗначениеПараметровДляСнятияСкриншотов) = Тип("Структура") Тогда
		Если ЗначениеПараметровДляСнятияСкриншотов.Свойство("ВыполнитьСледуюущийШаг") И ЗначениеПараметровДляСнятияСкриншотов.ВыполнитьСледуюущийШаг Тогда
			ИдСледующегоШага = ЗначениеПараметровДляСнятияСкриншотов.ИдСледующегоШага;
			ЗначениеПараметровДляСнятияСкриншотов = Неопределено;
			ПерейтиКВыполнениюСледующегоШага(, , ИдСледующегоШага);
			Возврат;
		КонецЕсли;	 
	КонецЕсли;	 
	
	ЗначениеПараметровДляСнятияСкриншотов = Неопределено;
	ПерейтиКВыполнениюСледующегоСценария();
КонецПроцедуры 

&НаКлиенте
Процедура СделатьСкриншотыОшибки()
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СделатьСкриншотыВсехОконКомпонентаПродолжение() Экспорт
	
	Если Объект.ИспользоватьКомпонентуVanessaExt
		И ДескрипторОсновногоОкнаТекущегоКлиентаТестирования <> Неопределено
		И ВнешняяКомпонентаДляСкриншотов <> Неопределено
		Тогда
		Попытка
			Оповещение = ОписаниеПустогоОбработчика(3);
			ВнешняяКомпонентаДляСкриншотов.НачатьВызовАктивироватьОкно(Оповещение, ДескрипторОсновногоОкнаТекущегоКлиентаТестирования);
		Исключение
			ЗаписатьЛогВЖРОшибка("СделатьСкриншотыВсехОконКомпонентаПродолжение", ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	МассивФайлов = Новый Массив;
	ПараметрыСкриншотов = Новый Структура;
	ПараметрыСкриншотов.Вставить("ИмяФайла", МассивФайлов);
	ПараметрыСкриншотов.Вставить("ИмяПроцедуры", "СделатьСкриншотыВсехОконКомпонентаПродолжение2");
	ПараметрыСкриншотов.Вставить("СпособСнятияСкриншотовВнешнейКомпонентой", 0);
	ПараметрыСкриншотов.Вставить("ИмяСкриншотаДляОтчета", "MainScreen");
	СделатьСкриншотКомпонента(ПараметрыСкриншотов);
КонецПроцедуры 

&НаКлиенте
Процедура СделатьСкриншотыВсехОконКомпонентаПродолжение2() Экспорт
