	Если Объект.СписокФичДляВыполнения.Количество() > 0 Тогда
		ФильтрФичСоответствие = Новый Соответствие;
		Счетчик = 0;
		Для Каждого Элем Из Объект.СписокФичДляВыполнения Цикл
			Счетчик = Счетчик + 1;
			ФильтрФичСоответствие.Вставить(Элем.Значение, Счетчик);
		КонецЦикла;
		
		СписокФич = Новый СписокЗначений;
		
		Счетчик = 0;
		Для Каждого ДанныеФичи Из МассивРезультатОбходаКаталогов Цикл
			
			Счетчик = Счетчик + 1;
			
			Если ДанныеФичи.Каталог Тогда
				Продолжить;
			КонецЕсли;	
			
			Файл = Новый Файл(ДанныеФичи.ПолныйПуть);
			
			НомерФичиВСписке = ФильтрФичСоответствие[ДанныеФичи.ПолныйПуть];
			Если НомерФичиВСписке = Неопределено Тогда
				НомерФичиВСписке = ФильтрФичСоответствие[Файл.Имя];
			КонецЕсли;	
			Если НомерФичиВСписке = Неопределено Тогда
				НомерФичиВСписке = ФильтрФичСоответствие[Файл.ИмяБезРасширения];
			КонецЕсли;	
			
			Если НомерФичиВСписке = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СписокФич.Добавить(НомерФичиВСписке, XMLСтрока(Счетчик - 1));
			
		КонецЦикла;
		
		СписокФич.СортироватьПоЗначению();
		
		НовыйМассивРезультатОбходаКаталогов = Новый Массив;
		Для Каждого Элем Из СписокФич Цикл
			НовыйМассивРезультатОбходаКаталогов.Добавить(МассивРезультатОбходаКаталогов[Число(Элем.Представление)]);
		КонецЦикла;
		
		МассивРезультатОбходаКаталогов = НовыйМассивРезультатОбходаКаталогов;
		
	КонецЕсли;	
	