	Дерево.Строки.Очистить();
	ТекДерево  = Дерево;
	ТекУровень = 0;
	
	Если Дерево.Колонки.Найти("МассивСценариевЗащитаОтЗацикливания") = Неопределено Тогда
		Дерево.Колонки.Добавить("МассивСценариевЗащитаОтЗацикливания");
	КонецЕсли;	 
	Если Дерево.Колонки.Найти("ЗначениеОтступа") = Неопределено Тогда
		Дерево.Колонки.Добавить("ЗначениеОтступа", Новый ОписаниеТипов("Число"));
	КонецЕсли;	 
	
	Для каждого Элем Из МассивРезультатОбходаКаталогов Цикл
		Если Элем.Уровень > ТекУровень Тогда
			ТекУровень = Элем.Уровень;
			НовСтр     = ТекДерево.Строки.Добавить();
			ТекДерево  = НовСтр;
		ИначеЕсли Элем.Уровень < ТекУровень Тогда
			Разн = ТекУровень - Элем.Уровень;
			Для Ккк = 1 По Разн Цикл
				НовСтр = НовСтр.Родитель;
			КонецЦикла;
			НовСтр     = НовСтр.Родитель.Строки.Добавить();
			ТекУровень = Элем.Уровень;
			ТекДерево  = НовСтр;
		Иначе	
			Если ТекДерево.Родитель = Неопределено Тогда
				НовСтр = Дерево.Строки.Добавить();
			Иначе
				НовСтр = ТекДерево.Родитель.Строки.Добавить();
			КонецЕсли;	
			ТекДерево  = НовСтр;
		КонецЕсли;  
		
		Если Элем.Каталог Тогда
			
			НовСтр.Тип        = "Каталог";
			НовСтр.ПолныйПуть = Элем.ПолныйПуть;
			НовСтр.Имя        = Элем.Имя;
		ИначеЕсли Элем.Фича Тогда
			
			НовСтр.Тип         = "Фича";
			НовСтр.ТипКартинки = 1;
			НовСтр.ПолныйПуть  = Элем.ПолныйПуть;
			НовСтр.Имя         = Элем.Имя;
		КонецЕсли;  
		
	КонецЦикла;
	